MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32MG13P732F512GM32/mcu.h
  uint32_t       RESERVED1[1U];       /**< Reserved for future use **/
  __IOM uint32_t AUXHFRCOCTRL;        /**< AUXHFRCO Control Register  */

  uint32_t       RESERVED2[1U];       /**< Reserved for future use **/
  __IOM uint32_t LFRCOCTRL;           /**< LFRCO Control Register  */
  __IOM uint32_t HFXOCTRL;            /**< HFXO Control Register  */

  uint32_t       RESERVED3[1U];       /**< Reserved for future use **/
  __IOM uint32_t HFXOSTARTUPCTRL;     /**< HFXO Startup Control  */
  __IOM uint32_t HFXOSTEADYSTATECTRL; /**< HFXO Steady State Control  */
  __IOM uint32_t HFXOTIMEOUTCTRL;     /**< HFXO Timeout Control  */
  __IOM uint32_t LFXOCTRL;            /**< LFXO Control Register  */

  uint32_t       RESERVED4[1U];       /**< Reserved for future use **/
  __IOM uint32_t DPLLCTRL;            /**< DPLL Control Register  */
  __IOM uint32_t DPLLCTRL1;           /**< DPLL Control Register  */
  uint32_t       RESERVED5[2U];       /**< Reserved for future use **/
  __IOM uint32_t CALCTRL;             /**< Calibration Control Register  */
  __IOM uint32_t CALCNT;              /**< Calibration Counter Register  */
  uint32_t       RESERVED6[2U];       /**< Reserved for future use **/
  __IOM uint32_t OSCENCMD;            /**< Oscillator Enable/Disable Command Register  */
  __IOM uint32_t CMD;                 /**< Command Register  */
  uint32_t       RESERVED7[2U];       /**< Reserved for future use **/
  __IOM uint32_t DBGCLKSEL;           /**< Debug Trace Clock Select  */
  __IOM uint32_t HFCLKSEL;            /**< High Frequency Clock Select Command Register  */
  uint32_t       RESERVED8[2U];       /**< Reserved for future use **/
  __IOM uint32_t LFACLKSEL;           /**< Low Frequency A Clock Select Register  */
  __IOM uint32_t LFBCLKSEL;           /**< Low Frequency B Clock Select Register  */
  __IOM uint32_t LFECLKSEL;           /**< Low Frequency E Clock Select Register  */

  uint32_t       RESERVED9[1U];       /**< Reserved for future use **/
  __IM uint32_t  STATUS;              /**< Status Register  */
  __IM uint32_t  HFCLKSTATUS;         /**< HFCLK Status Register  */
  uint32_t       RESERVED10[1U];      /**< Reserved for future use **/
  __IM uint32_t  HFXOTRIMSTATUS;      /**< HFXO Trim Status  */
  __IM uint32_t  IF;                  /**< Interrupt Flag Register  */
  __IOM uint32_t IFS;                 /**< Interrupt Flag Set Register  */
  __IOM uint32_t IFC;                 /**< Interrupt Flag Clear Register  */
  __IOM uint32_t IEN;                 /**< Interrupt Enable Register  */
  __IOM uint32_t HFBUSCLKEN0;         /**< High Frequency Bus Clock Enable Register 0  */

  uint32_t       RESERVED11[3U];      /**< Reserved for future use **/
  __IOM uint32_t HFPERCLKEN0;         /**< High Frequency Peripheral Clock Enable Register 0  */

  uint32_t       RESERVED12[7U];      /**< Reserved for future use **/
  __IOM uint32_t LFACLKEN0;           /**< Low Frequency a Clock Enable Register 0  (Async Reg)  */
  uint32_t       RESERVED13[1U];      /**< Reserved for future use **/
  __IOM uint32_t LFBCLKEN0;           /**< Low Frequency B Clock Enable Register 0 (Async Reg)  */

  uint32_t       RESERVED14[1U];      /**< Reserved for future use **/
  __IOM uint32_t LFECLKEN0;           /**< Low Frequency E Clock Enable Register 0 (Async Reg)  */
  uint32_t       RESERVED15[3U];      /**< Reserved for future use **/
  __IOM uint32_t HFPRESC;             /**< High Frequency Clock Prescaler Register  */

  uint32_t       RESERVED16[1U];      /**< Reserved for future use **/
  __IOM uint32_t HFCOREPRESC;         /**< High Frequency Core Clock Prescaler Register  */
  __IOM uint32_t HFPERPRESC;          /**< High Frequency Peripheral Clock Prescaler Register  */

  uint32_t       RESERVED17[1U];      /**< Reserved for future use **/
  __IOM uint32_t HFEXPPRESC;          /**< High Frequency Export Clock Prescaler Register  */

  uint32_t       RESERVED18[2U];      /**< Reserved for future use **/
  __IOM uint32_t LFAPRESC0;           /**< Low Frequency a Prescaler Register 0 (Async Reg)  */
  uint32_t       RESERVED19[1U];      /**< Reserved for future use **/
  __IOM uint32_t LFBPRESC0;           /**< Low Frequency B Prescaler Register 0  (Async Reg)  */
  uint32_t       RESERVED20[1U];      /**< Reserved for future use **/
  __IOM uint32_t LFEPRESC0;           /**< Low Frequency E Prescaler Register 0  (Async Reg)  */

  uint32_t       RESERVED21[3U];      /**< Reserved for future use **/
  __IM uint32_t  SYNCBUSY;            /**< Synchronization Busy Register  */
  __IOM uint32_t FREEZE;              /**< Freeze Register  */
  uint32_t       RESERVED22[2U];      /**< Reserved for future use **/
  __IOM uint32_t PCNTCTRL;            /**< PCNT Control Register  */

  uint32_t       RESERVED23[2U];      /**< Reserved for future use **/
  __IOM uint32_t ADCCTRL;             /**< ADC Control Register  */

  uint32_t       RESERVED24[4U];      /**< Reserved for future use **/
  __IOM uint32_t ROUTEPEN;            /**< I/O Routing Pin Enable Register  */
  __IOM uint32_t ROUTELOC0;           /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC1;           /**< I/O Routing Location Register  */
  uint32_t       RESERVED25[1U];      /**< Reserved for future use **/
  __IOM uint32_t LOCK;                /**< Configuration Lock Register  */
  __IOM uint32_t HFRCOSS;             /**< HFRCO Spread Spectrum Register  */

  uint32_t       RESERVED26[30U];     /**< Reserved for future use **/
  __IOM uint32_t LFRCLKSEL;           /**< Low Frequency R Clock Select Register  */
  uint32_t       RESERVED27[3U];      /**< Reserved for future use **/
  __IOM uint32_t LFRCLKEN0;           /**< Low Frequency R Clock Enable Register 0  (Async Reg)  */
  uint32_t       RESERVED28[1U];      /**< Reserved for future use **/
  __IOM uint32_t LFRPRESC0;           /**< Low Frequency R Prescaler Register 0 (Async Reg)  */
} CMU_TypeDef;                        /** @} */

// #include "efr32mg13p_crypto.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_prs_ch.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_prs.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_ldma_ch.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_ldma.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_fpueh.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_timer.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_usart.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_cryotimer.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_adc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_vdac_opa.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_vdac.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_csen.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_lesense.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_rtcc_cc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_rtcc_ret.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_rtcc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_rtc_comp.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_rtc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_wdog_pch.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_etm.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_idac.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_smu.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_trng.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_romtable.h"  // Note: Changed for MikroE implementation.

